[
        {
            "title": "Honmoon (혼문)",
            "img": {
                "src": "../assets/vocab-pics/honmoon.png",
                "alt": "A picture of the honmoon glowing blue."
            },
            "content": "Honmoon translates to “soul‑gate”. This of course refers to how the Honmoon—a barrier between the demon realm and our world—is powered: by the souls of the Huntrix’s fans. The Honmoon is a concept created for the movie but takes inspiration from Korean shamanism. Korean shamans, or mudang (무당), are said to be able to open the boundaries between realms for spirits.",
            "sources": [
                {
                    "author": "Kondo, Beatrix",
                    "title": "The Demons of K-Pop Demon Hunters: What’s Real Korean Myth and What’s Movie Magic",
                    "website": "Soap Central",
                    "publisher": "Soap Central",
                    "date": "22 June 2025",
                    "link": "https://www.soapcentral.com/entertainment/the-demons-k-pop-demon-hunters-what-s-real-korean-myth-movie-magic"
                },
                {
                    "title": "Korean Shamanism in Kpop Demon Hunters: The Hidden Role of the Mudang",
                    "website": "The Unwritten Past",
                    "date": "22 Aug. 2025",
                    "link": "https://theunwrittenpast.com/korean-shamanism-in-kpop-demon-hunters/"
                },
                {
                    "title": "Korean Words from K-Pop Demon Hunters",
                    "website": "Tandem",
                    "publisher": "Tandem",
                    "link": "https://tandem.net/blog/kpop-demon-hunters",
                    "accessed": "24 Oct. 2025"
                }
            ]
        },
        {
            "title": "Mudang (무당)",
            "img": {
                "src": "../assets/vocab-pics/mudang.png",
                "alt": "A picture of the first demon hunters in KPop Demon Hunters."
            },
            "content": "The mudang are Korean shamans—traditionally women—who use \"[m]ovement, breath, and rhythm\" to connect with the spirit world. \"[C]reating harmony between body, sound, and spirit\" is important.\n\nThe film <em>KPop Demon Hunters</em> was influenced by mudang tradition. For example, the demon hunters, like the mudang, have to bring people together and can influence the boundaries between realms. Moreover, the weapons that Huntrix uses are inspired by ceremonial blades used in shamanic rituals. Finally, demon hunters also seem to be traditionally women.\n\nEven in real life, K-pop performances and shamanic rituals have been compared. \"[R]hythm, repetition, and emotional intensity\" are important to both K-pop performances and shamanic rituals. It is said that both roles require being \"born with the saju (사주), or spiritual constitution\".",
                "sources": [
                    {
                        "title": "Korean Shamanism in Kpop Demon Hunters: The Hidden Role of the Mudang",
                        "website": "The Unwritten Past",
                        "date": "22 Aug. 2025",
                        "link": "https://theunwrittenpast.com/korean-shamanism-in-kpop-demon-hunters/"
                    }
                ]
        },
        {
            "title": "Magwi (마귀)",
            "img": {
                "src": "../assets/vocab-pics/magwi.png",
                "alt": "A picture of Gwi-Ma receiving stolen souls."
            },
            "content": "Magwi means \"demon\", \"devil\", or \"evil spirit\" in Korean. Notice that Magwi is Gwi-Ma but with the syllables reversed. Ma itself means demon or a barrier to something someone is trying to accomplish. Gwi means ghost. So Gwi-Ma itself means \"ghost-demon\".",
                "sources": [
                    {
                        "author": "Talk To Me In Korean",
                        "title": "K-pop Demon Hunters explained by a Korean teacher",
                        "website": "YouTube",
                        "date": "18 July 2025",
                        "link": "https://www.youtube.com/watch?v=qCmpU3ssip8"
                    },
                    {
                        "title": "Gwi-Ma",
                        "website": "Villains Wiki",
                        "publisher": "Fandom, Inc.",
                        "link": "https://villains.fandom.com/wiki/Gwi-Ma",
                        "accessed": "24 Oct. 2025"
                    }
                ]
        },
        {
            "title": "Norigae (노리개)",
            "img": {
                "src": "../assets/vocab-pics/norigae.jpg",
                "alt": "An up-close picture of Rumi, Mira, and Zoey's norigae. As indicated by the picture, Rumi's norigae is traditional, Mira's norigae is bold, and Zoey's norigae is fun."
            },
            "content": "A norigae is a traditional Korean pendant usually worn by women. It was historically one of the few ornaments that could be worn across all social classes (though lower class women wore simpler norigae than upper class women), and was often a treasured heirloom passed down as a wedding gift.\n\nEach norigae is different, expressing an individual’s taste, identity, social status, and wishes. Possible wishes represented in norigae include good luck, protection, longevity, prosperity, and the hope for many children. Despite each norigae’s individuality, they share similarities, being each composed of a main ornament (paemul 패물), intricate knots (maedeup 매듭), tassels (sul 술), and a hook (ddidon 띠돈) for attaching the norigae. A norigae can have a varying number of pendants, with one pendant (danjak 단작) and three pendants (samjak 삼작) being the most popular.\n\nThe Huntrix members wear norigae during their “How It’s Done” performance. Rumi’s norigae has a Gajipangsok knot, which symbolizes abundance and continuity. Mira’s norigae has a butterfly knot, which symbolizes transformation and beauty. Zoey’s norigae has a chrysanthemum knot, which symbolizes longevity and good fortune.",
                "sources": [
                    {
                        "author": "Bradley, Hallie",
                        "title": "Knot Your Average Souvenir: The Korean Norigae",
                        "website": "The Soul of Seoul",
                        "date": "13 June 2025",
                        "link": "https://thesoulofseoul.net/knot-your-average-souvenir-the-korean-norigae/"
                    },
                    {
                        "title": "Exploring the Art of Korean Norigae: A Tradition of Knots and Symbols",
                        "website": "BIROSO",
                        "date": "3 Sept. 2024",
                        "link": "https://biroso.net/blogs/%EB%89%B4%EC%8A%A4/exploring-the-art-of-korean-norigae-a-tradition-of-knots-and-symbols"
                    },
                    {
                        "author": "K-culture Mania",
                        "title": "Korean Heritage Meets Modern K-pop in Demon Hunter Style",
                        "website": "YouTube",
                        "date": "14 July 2025",
                        "link": "https://www.youtube.com/watch?v=JxNInPbAk8c"
                    },
                    {
                        "author": "M, Anyaa",
                        "title": "Norigae Explained: Symbolism, History, and New KPop Demon Hunters Trend",
                        "website": "Korea Travel Post",
                        "date": "29 Aug. 2025",
                        "link": "https://www.koreatravelpost.com/norigae-korea-traditional-charm-returns-through-kpop-demon-hunters/"
                    },
                    {
                        "title": "Norigae - All You Need to Know About This Traditional Korean Accessory",
                        "website": "My Korean Addiction",
                        "date": "5 Jan. 2025",
                        "link": "https://mykoreanaddiction.com/norigae-korean-accessory"
                    },
                    {
                        "author": "Quaresma, Milena",
                        "title": "K-Pop Demon Hunters: Traditional Korean Easter Eggs You Probably Missed",
                        "website": "Lingopie",
                        "date": "9 Sept. 2025",
                        "link": "https://lingopie.com/blog/k-pop-demon-hunters-traditional-korean-easter-eggs-you-probably-missed/"
                    }
                ]
        },
        {
            "title": "Gat (갓)",
            "img": {
                "src": "../assets/vocab-pics/gat.jpg",
                "alt": "A diagram explaining the different parts of a gat. It also depicts two different gat variations: the heukrip (흑립) and the jeollip (절립)."
            },
            "content": "A gat is a traditional Korean hat made of horsehair and bamboo. It has two main components: a brim (yangtae 양태) and a crown (moja 모자). The string attached to the gat is called a gatkkeun (갓끈). The gatkkeun can be decorated with beads of various materials, which helps weigh the gat down.\n\nThe gat reflects one’s social status and represents wisdom and dignity. Unlike in the west, where it is polite to remove your hat, it was considered respectful to keep your gat on. The gat was typically worn by men, especially noblemen, during the Joseon Dynasty (1392-1897 or 1392-1910, depending on the specification) — the time in which Jinu would have lived. The Saja Boys each wear a black gat, or heukrip (흑립), when they are first introduced and during their “Your Idol” performance.",
                "sources": [
                    {
                        "title": "Gat(갓), The Korean Traditional Hat",
                        "website": "Ccorea",
                        "date": "14 July 2025",
                        "link": "https://ccorea.com/blogs/news/korean-traditional-hat"
                    },
                    {
                        "author": "K-culture Mania",
                        "title": "Korean Heritage Meets Modern K-pop in Demon Hunter Style",
                        "website": "YouTube",
                        "date": "14 July 2025",
                        "link": "https://www.youtube.com/watch?v=JxNInPbAk8c"
                    },
                    {
                        "title": "K-Pop Demon Hunters’ Saja Boys: Grim Reapers (저승사자, jeosung-saja), Gat (갓) & The Dance Across the Veil",
                        "website": "KoreAtlas",
                        "date": "14 July 2025",
                        "link": "https://koreatlas.com/k-pop-demon-hunters-saja-boys-grim-reapers-jeosung-saja-gat-the-dance-across-the-veil/"
                    },
                    {
                        "title": "‘That Hat Is Called a Gat!’ - What Jinu Wore in K-Pop Demon Hunters",
                        "website": "Easy Korean Chat",
                        "publisher": "Easy Korean Chat",
                        "date": "7 July 2025",
                        "link": "https://easykoreanchat.com/blogs/real-culture/that-hat-is-called-a-gat-what-jinu-wore-in-k-pop-demon-hunters"
                    },
                    {
                        "title": "Headgear and Accessories",
                        "website": "East Asian Societies",
                        "publisher": "Weebly",
                        "link": "https://easociety.weebly.com/headgear-and-accessories.html",
                        "accessed":"24 Oct. 2025"
                    },
                    {
                        "author": "Lorenzo",
                        "title": "Man’s Hanbok – Gatkkeun",
                        "website": "Lorenzo’s Workshop",
                        "publisher": "Lorenzo’s Workshop",
                        "date": "17 Dec. 2020",
                        "link": "https://www.dellacivetta.org/lorenzo/2020/12/17/gatkkeun/"
                    }
                ]
        },
        {
            "title": "Saja (사자)",
            "img": {
                "src": "../assets/vocab-pics/saja.png",
                "alt": "A picture of the Saja Boys in their demon forms."
            },
            "content": "Saja has two meanings. When pronounced with a short vowel (獅子), saja means \"lion.\" Hence, the Saja Boys’ logo is a lion and their fandom is called the Pride. On the other hand, when pronounced with a long vowel (使者), saja means \"envoy\" or \"messenger.\" In particular, jeoseung saja (저승사자) literally means \"underworld messenger.\" In Korean mythology, there are multiple jeoseung saja, each of whom record the names of the deceased and guide souls to the afterlife. They are not inherently malevolent spirits but instead maintain the cosmic balance—in some folktales, a jeoseung saja may display compassion and offer a few more moments of life. They all serve King Yama (or Yeomra-daewang 염라대왕), the King of the Underworld, who determines a soul’s fate after death. The jeoseung saja are usually depicted as men, each of whom wear a gat (갓), a traditional Korean hat that reflects their status as entities performing official duties. The Saja Boys similarly each wear a gat (갓). Like the two meanings of saja, the Saja Boys have a dual nature — the false, bubbly side they show during \"Soda Pop\" and their true, darker side they reveal during \"Your Idol.\"",
                "sources": [
                    {
                        "author": "Jahangiri, Narjes",
                        "title": "What You Need to Know about Saja Boys, Korean’s Grim Reapers in K_pop Form",
                        "website": "Honorary Reporters",
                        "publisher": "Ministry of Culture, Sports and Tourism",
                        "date": "16 July 2025",
                        "link": "https://honoraryreporters.korea.net/board/detail.do?articlecate=1&board_no=29698&tpln=1"
                    },
                    {
                        "title": "K-Pop Demon Hunters’ Saja Boys: Grim Reapers (저승사자, jeosung-saja), Gat (갓) & The Dance Across the Veil",
                        "website": "KoreAtlas",
                        "date": "14 July 2025",
                        "link": "https://koreatlas.com/k-pop-demon-hunters-saja-boys-grim-reapers-jeosung-saja-gat-the-dance-across-the-veil/"
                    },
                    {
                        "author": "Nair, Nitten",
                        "title": "Jeoseung Saja : The Korean Grim Reaper",
                        "website": "Mythlok",
                        "date": "22 Oct. 2025",
                        "link": "https://mythlok.com/jeoseung-saja/"
                    },
                    {
                        "author": "Talk To Me In Korean",
                        "title": "K-pop Demon Hunters explained by a Korean teacher",
                        "website": "YouTube",
                        "date": "18 July 2025",
                        "link": "https://www.youtube.com/watch?v=qCmpU3ssip8"
                    }
                ]
        },

        {
            "title": "Saingeom (사인검)",
            "img": {
                "src": "../assets/vocab-pics/saingeom.jpg",
                "alt": "A picture of a real saingeom sword. It has a gray blade decorated with golden constellations."
            },
            "content": "Saingeom (사인검) or \"Four Tigers Sword\" is also called sainchamsageom, or \"Four Tigers Evil-Cutting Sword\". This is the name of the weapon Rumi wields. The saingeom is a ceremonial sword used in traditional Korean shamanic rituals (called gut 굿 rituals), protecting the people against spiritual evils rather than being used in battle. Hence, the blade is only sharpened at the front and is made of soft iron. It is also decorated with auspicious symbols and constellations in silver or gold.\n\nAdditionally, the saingeom is rare, because it is forged during the tiger year (In-nyeon), tiger month (In-wol), tiger day (In-il), and tiger hour (In-si), an alignment that occurs about once every 60 years. In Korean cosmology, four tigers protect the four cardinal directions, and it was believed that a sword made with stronger tiger energy had more of the positive spiritual power called Yang. Thus, the saingeom was considered the strongest spiritual weapon, as compared to the other types of ingeom (인검), or \"tiger sword\".\n\nThe saingeom originates from the Joseon Dynasty, during which it symbolized the authority of the royal family and was even used by kings during shamanic rituals.",
            "sources": [
                {
                    "author": "Cambal, Abigail",
                    "title": "Types of Korean Swords You Might Not Know About",
                    "editor": "Juliana Cummings",
                    "website": "Swordis",
                    "date": "13 Feb. 2025",
                    "link": "https://swordis.com/blog/types-of-korean-swords/"
                },
                {
                    "title": "HUNTRIX Weapons: Korean Traditional Arms in K-Pop Demon Hunters",
                    "website": "KoreAtlas",
                    "link": "https://koreatlas.com/k-pop-demon-hunters-huntrix-weapons/",
                    "accessed": "6 Oct. 2025"
                },
                {
                    "title": "Korean Mythology",
                    "website": "TV Tropes",
                    "link": "https://tvtropes.org/pmwiki/pmwiki.php/Myth/KoreanMythology",
                    "accessed": "27 Oct. 2025"
                },
                {
                    "title": "Korean Shamanism in Kpop Demon Hunters: The Hidden Role of the Mudang",
                    "website": "The Unwritten Past",
                    "date": "22 Aug. 2025",
                    "link": "https://theunwrittenpast.com/korean-shamanism-in-kpop-demon-hunters/"
                },
                {
                    "title": "Korean Sword",
                    "website": "Military Wiki",
                    "publisher": "Fandom, Inc.",
                    "link": "https://military-history.fandom.com/wiki/Korean_sword",
                    "accessed": "27 Oct. 2025"
                },
                {
                    "title": "The Origin of ‘KPop Demon Hunters’ Weapons: 100% REAL and Where to Find Them",
                    "website": "KoreaTravelPost",
                    "date": "5 July 2025",
                    "link": "https://www.koreatravelpost.com/kpop-demon-hunters-huntrix-weapons-history-real-life-origin-places-to-visit/"
                },
                {
                    "author": "Quaresma, Milena",
                    "title": "K-Pop Demon Hunters: Traditional Korean Easter Eggs You Probably Missed",
                    "website": "Lingopie",
                    "date": "9 Sept. 2025",
                    "link": "https://lingopie.com/blog/k-pop-demon-hunters-traditional-korean-easter-eggs-you-probably-missed/"
                }
            ]
        },

        {
            "title": "Hoobae (후배) and Sunbae (선배)",
            "img": {
                "src": "../assets/vocab-pics/sunbae-hoobae.png",
                "alt": "A picture of Huntrix and the Saja Boys bowing to each other in the movie's game show scene."
            },
            "content": "During the game show scene in <em>KPop Demon Hunters</em>, Rumi calls the Saja Boys her hoobaes: \"We just wanted to stop by and congratulate our hoobaes on their debut.\" What does Rumi mean by hoobae (후배)?\n\nA hoobae is someone with less experience than you, while a sunbae (선배) is someone with more experience than you. Age itself isn't the most important factor; experience level is. In the case of the K-pop industry, those who debut earlier are sunbaes and those who debut later are hoobaes. These terms can also be used to describe who entered a company or university first.\n\nHoobaes may refer to their sunbaes as \"NAME + sunbae-nim\" — or \"NAME + sunbae\" after getting on friendly terms. Additionally, as a show of respect, hoobaes bow 90 degrees to their sunbaes. Sunbaes could call their hoobaes \"NAME + hoobae-nim\" but usually one wouldn’t address someone directly as a hoobae, because hoobae is considered a lower position. Instead, one would typically use \"NAME ssi,\" \"NAME nim,\" or \"NAME + position.\"\n\nThus, the Saja Boys are Huntrix’s hoobaes and Huntrix is the Saja Boys’ sunbaes. We also see the Saja Boys bowing to Huntrix, as expected in a sunbae-hoobae dynamic.\n\nAs a side note: the correct spelling of hoobae and sunbae based on romanization rules is hubae and seonbae, but most people use hoobae and sunbae.",
            "sources": [
                {
                    "author": "Seo, Minjung",
                    "title": "Don’t Call Someone Sunbae (선배) Before Reading This!",
                    "website": "Lingu Asia",
                    "date": "6 Aug. 2024",
                    "link": "https://linguasia.com/sunbae"
                },
                {
                    "author": "Seo, Minjung",
                    "title": "What Hoobae (후배) Means in Korean and How to Use it",
                    "website": "Lingu Asia",
                    "date": "6 Aug. 2024",
                    "link": "https://linguasia.com/hoobae"
                },
                {
                    "author": "Talk To Me In Korean",
                    "title": "More Detailed Explanation of K-pop Demon Hunters by a Korean Teacher",
                    "website": "YouTube",
                    "date": "1 Aug. 2025",
                    "link": "https://www.youtube.com/watch?v=mozwhO1jqh4&t=247s"
                }
            ]
        },

        {
            "title": "Nim (님)",
            "img": {
                "src": "../assets/vocab-pics/nim.png",
                "alt": "A picture of Doctor Han and the Huntrix band members greeting each other."
            },
            "content": "In <em>KPop Demon Hunters</em>, Doctor Han refers to Rumi as \"Rumi Nim.\" Nim (님) is an honorific similar to Mr./Ms. in English. So, \"Rumi Nim\" can be translated as \"Ms. Rumi.\"\n\nNim is also placed after occupations and titles. For example, the word for teacher is seonsaeng (선생), and when talking to or about a teacher, you would say seonsaengnim (선생님). If you want to specify one’s family name in addition to their title, you would place the name in front of the title: Park seonsaengnim (박 선생님) means Teacher Park. Similarly, nim can be placed after family titles. For example, the honorific family title for grandmother is halmeonim (할머님).",
            "sources": [
                {
                    "author": "Armstrong, Joe",
                    "title": "Korean Honorifics – How to Speak Respectfully in Korean",
                    "website": "90 Day Korean",
                    "publisher": "90 Day Languages LLC",
                    "date": "10 Nov. 2025",
                    "link": "https://www.90daykorean.com/korean-honorifics/"
                },
                {
                    "author": "Talk To Me In Korean",
                    "title": "More Detailed Explanation of K-pop Demon Hunters by a Korean Teacher",
                    "website": "YouTube",
                    "date": "1 Aug. 2025",
                    "link": "https://www.youtube.com/watch?v=mozwhO1jqh4&t=247s"
                }
            ]

        },
        {
            "title": "Gaja (가자)",
            "img": {
                "src": "../assets/vocab-pics/gaja.png",
                "alt": "A picture of Huntrix entering Doctor Han's clinic. Zoey is excited and drags Rumi inside by the arm."
            },
            "content": "Throughout the film, \"Gaja\" is heard multiple times. Zoey says, \"Gaja, gaja, gaja, gaja!\" as Huntrix enters Doctor Han’s clinic, and Zoey and Mira both say it right before their performance at the Idol Awards.\n\nGaja (가자) means \"Let’s go!\" It is common to repeat the word multiple times — though it is usually not repeated as many as four times. Zoey’s use of the word four times when entering the clinic, however, reflects her energetic personality.",
            "sources": [
                {
                    "author": "Talk To Me In Korean",
                    "title": "More Detailed Explanation of K-pop Demon Hunters by a Korean Teacher",
                    "website": "YouTube",
                    "date": "1 Aug. 2025",
                    "link": "https://www.youtube.com/watch?v=mozwhO1jqh4&t=247s"
                }
            ]

        },
        {
            "title": "Ramyeon (라면)",
            "img": {
                "src": "../assets/vocab-pics/ramyeon.png",
                "alt": "A picture of Huntrix eating ramyeon."
            },
            "content": "At the beginning of <em>KPop Demon Hunters</em>, we see Rumi, Mira, and Zoey eating ramyeon (라면) out of cups designed just for them. Rumi’s flavor is superstar, Mira’s flavor is spice queen, and Zoey’s flavor is hamburger. But what is ramyeon (also spelled ramyun), and what is its origins?\n\nIn the early 1900s, a Chinese dish made its way to Japan. This dish ultimately became the classic Japanese ramen (ラーメン) dish. Later, instant ramen was invented in 1958 by Taiwanese-Japanese businessman Momofuku Ando, during a time in which Japan was stricken by poverty after World War II. Instant ramen was produced quickly and cheaply by flash-frying noodles first.\n\nIn the 1960s, Korean businessman Jean Jong-Yeon discovered instant ramen during a trip to Japan. He created ramyeon, a quick and cheap option for people after the Korean war. While ramen can be fresh or instant, ramyeon is always instant.\n\nBoth ramyeon and ramen have many variations, but there are a few things that differentiate ramyeon and ramen. Ramyeon is known for its spicy broth, while ramen is known for the umami flavor of its noodles (which is caused by boiling the noodles in savory chicken or pork stock). Additionally, ramyeon ingredients are all cooked together, while ramen noodles are added to a strained broth.",
            "sources": [
                {
                    "author": "Miller, Robin",
                    "title": "The Real Difference Between Ramen And Ramyeon",
                    "website": "Mashed",
                    "date": "18 Mar. 2021",
                    "link": "https://www.mashed.com/359481/the-real-difference-between-ramen-and-ramyeon/"
                },
                {
                    "title": "Why Do K-Pop Demon Hunters Choose Cup Rumyun Over Restaurant Ramen?",
                    "website": "KoreAtlas",
                    "date": "28 Oct. 2025",
                    "link": "https://koreatlas.com/korean-ramyeon-culture-kpop-demon-hunters/"
                }
            ]

        }
    ]